""" первая задания"""
def one():
    negative = 0 # инициализируем переменную для хранения отрицательных значений функции
    """ чтобы в цикле перебирать значения с шагом нужно использовать range, но в Питоне range работает только с integer """
    """ поэтому просто домножим на 10 чтобы шаг 0.5 стал целым числом, внутри цикла поделим на 10 """
    """ Т.к. крайнаа граница промежутка не попадает в цикл for то ставим границу 55 """
    for x in range(-50, 55, 5):
        x = x / 10
        y = x ** 2 - 4 * x + 3 # формула квадратного уравнения
        print(f"X = {x}, Y = {y}")
        if y < 0: # если значение функции отрицатедное то увеличиваем счетчик
            negative += 1 # negative = negative + 1
    print(f"Всего значений функции меньше нуля: {negative} раз(а)")


""" второе задание """
def two():
    positive_sum = 0  # сумма положительных чисел
    positive_count = 0 # количсетво положительных чисел
    even_sum = 0 # сумма четных чисел
    count = 0 # общее количество чисел
    mean = 0 # среднее арифмитическое положительных чисел
    while (a := int(input("Введите чилсло (ноль выход): "))) != 0:
        count += 1 # увеличиваем счетчик чисел
        if a % 2 == 0: # если число делитеся на 2 без остатка то оно четное
            even_sum += a # увеличиваем сумму четных чисел
        if a > 0: # если число положительное, то увеличиваем сумму и счетчик положительных чисел
            positive_count += 1
            positive_sum += a
    print(f"Количество введеных чисел: {count}")
    print(f"Сумма всех четных чисел: {even_sum}")
    if positive_count > 0: # если количество положительных чисел больше 0, то считаем среднеее арифмитическое для положительных чисел
        mean = positive_sum / positive_count 
        print(f"Срднее арифмитическое положительных чисел {mean}")
    else:
        print("Положительных чисел не было")


""" третье задание """
def three():
    n = int(input("Введите натуральное число: "))
    result = [] # список простых делителей
    for i in range(2, n): # запускаем цикл от 2 до n (на 1 и на сомого себя делятся все числа )
        if n % i == 0: # если число из промежутка делит число без остатка, то это делитель
            simple = True # предпологаем что делитель простой
            for j in range(2, i): # осталось проверить что делитель простой (простое число делится только на 1 и на само себя, есди оно делится еще на что то, то оно не простое)
                if i % j == 0: # делитель делится еще на какое то число без остатка, то сбрасываем перемнную "простости")) в False
                    simple = False
            if simple: # если делитель все таки простой, то добавляем его в список делителей
                result.append(i)
    if result == []: # если делителей не было найдено, то само введенное число простое
        print(f"Число {n} простое")
    else: # иначе выводим список дклитклей
        print(f"Простые делители числа {n}: {result}")
                

""" четвертое задание """
def four():
    """ перебираем числа в диапазоне от 1 до 10 """
    for i in range(1,11):
        value = 0 # инициализируем переменную в которой будет выводимый результат 
        for _ in range(1, 11): # т.к. не используем умножение, то делаем сложение в цикле, т.к. саму переменную мы не используем, нам просто нужно 10 итераций, то можно записать _ вместо нее
            value += i
            print(f"{value:4}", end="") # используем фрпматируемый вывод, чтобы не было перевода строки после каздого числа ставим end="", {value:4} - это значит что для вывода числа используется 4 ячейки, чтобы между цифрпами было расстояние
        print("\n") # после вывода каждой строки переходим на другую строку

print("Первое задание")
one()
print("Второе задание")
two()
print("Третье задание")
three()
print("Четвертое задание")
four()