""" Ввод чисел и сразу разбиваем его на список, разделитель пробел"""
a = (input("Введите список чисел через пробел: ")).split(" ")
""" Т.к. унас получились строковые переменные в списке то переделываем их в числовые"""
a = [int(x) for x in a]

"""Запасной вариант если лень разбираться с предыдущим кодом, просто статичный список, тольо удали решетку вначале))"""
#a = [1, 23, 78, 899, 142, 354, 90, 1546, 364, 2, 45, 156, 3774, 11, 23]
print(f"Список введеных чисел: {a}")

""" Т.к. использовать max нельзя, то по умолчанию делаем первый элемент списка максимальным """
max = a[0]

""" Создаем пустые списки для четных и нечетных чисел """
even_num = []
odd_num = []

""" запускаем цикл и перебираем все элемаенты списка a"""
for i in a:
    """ Если есть остаток от деления на 2 то if True, то есть выполняется первое действие"""
    """ Если остаткуа нет то переходим к else"""
    if i % 2:
        """добавляем число к списку нечетных"""
        odd_num.append(i)
    else:
        """добавляем число к списку четных"""
        even_num.append(i)
    """ если текущее число больше максимального, то оно становится максимальным"""
    if i > max:
        max = i

"""Выводим всякое"""
print(f"Максимальное число: {max}")
print(f"Четные числа: {even_num}")
print(f"Нетные числа: {odd_num}")